Project/Toir/src/ChartsOfCharacteristicTypes/АтрибутыКласса/АтрибутыКласса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>АтрибутыКласса</name>
  <type>
    <types>EnumRef.торо_ТипЭксплуатации</types>
    <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    <types>CatalogRef.торо_МерыБезопасности</types>
    <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    <types>EnumRef.торо_ВидыДокументаВводНачДанных</types>
    <types>CatalogRef.ВидыНоменклатуры</types>
    <types>CatalogRef.торо_ПричиныИзмененияНаработки</types>
    <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
    <types>CatalogRef.ОбъектыНоменклатуры</types>
    <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    <types>CatalogRef.Номенклатура</types>
    <types>EnumRef.ВидыДнейПроизводственногоКалендаря</types>
    <types>CatalogRef.торо_ВидыОценок</types>
    <types>EnumRef.торо_СпособыЗамещенияРемонтов</types>
    <types>EnumRef.Периодичность</types>
    <types>CatalogRef.торо_ВидыПусковОР</types>
    <types>CatalogRef.торо_ТипыКоэффициентовПереводаСтоимостейРемонтов</types>
    <types>CatalogRef.ВариантыЗначенийАтрибутовКласса</types>
    <types>EnumRef.СтавкиНДС</types>
    <types>CatalogRef.торо_ПричиныДефектов</types>
    <types>CatalogRef.торо_РесурсыРемонтнойБригады</types>
    <types>EnumRef.торо_ОтветственныеЛица</types>
    <types>CatalogRef.торо_ВидыКоэффициентовРемонтныхОсобенностей</types>
    <types>CatalogRef.торо_ОбъектыРемонта</types>
    <types>EnumRef.ТипыНоменклатуры</types>
    <types>EnumRef.торо_СтатусыДокументов</types>
    <types>CatalogRef.Валюты</types>
    <types>EnumRef.СтатусыОбъектовНСИ</types>
    <types>CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    <types>CatalogRef.торо_ВидыЭксплуатации</types>
    <types>EnumRef.ТипыКонтактнойИнформации</types>
    <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
    <types>Boolean</types>
    <types>EnumRef.торо_ВидыОперацийОтклоненияВРаботеОборудования</types>
    <types>CatalogRef.Классы</types>
    <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
    <types>EnumRef.торо_ВидыВыходныхДокументов</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>CatalogRef.Контрагенты</types>
    <types>EnumRef.АмортизационныеГруппы</types>
    <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    <types>CatalogRef.торо_КритерииОценки</types>
    <types>CatalogRef.СерииНоменклатуры</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.торо_ПричиныЗакрытияРемонтов</types>
    <types>String</types>
    <types>CatalogRef.торо_КритичностьДефекта</types>
    <types>CatalogRef.торо_ПричиныПростояОборудования</types>
    <types>EnumRef.торо_ВидыОперацийПланаГрафикаППР</types>
    <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
    <types>Date</types>
    <types>CatalogRef.НоменклатураКласса</types>
    <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
    <types>CatalogRef.торо_СтруктурыОР</types>
    <types>Number</types>
    <types>EnumRef.торо_ПредставлениеОРДляПечати</types>
    <types>CatalogRef.торо_ПриоритетыОбъектовРемонта</types>
    <types>CatalogRef.торо_РемонтныеБригады</types>
    <types>CatalogRef.торо_ЗначенияИзмеряемыхПоказателейОбъектовРемонта</types>
    <types>CatalogRef.торо_ЗначенияКоэффициентовРемонтныхОсобенностей</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    <types>EnumRef.торо_ВидыПредставленийВРДляПечати</types>
    <types>EnumRef.СпособыСтроительства</types>
    <types>EnumRef.торо_ВидыДвиженияСерийныхЗЧ</types>
    <types>CatalogRef.ЕдиницыИзмерения</types>
    <types>EnumRef.торо_ВидыПростояОборудования</types>
    <types>CatalogRef.ПараметрыВыработкиОС</types>
    <types>EnumRef.ДниНедели</types>
    <types>CatalogRef.торо_Сезоны</types>
    <types>CatalogRef.торо_ВидыРемонтов</types>
    <types>CatalogRef.ВидыКонтактнойИнформации</types>
    <types>CatalogRef.торо_ВидыДефектов</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1000</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВидОперации</name>
      <description>Вид операции</description>
      <code>00000000003</code>
      <type>
        <types>CatalogRef.НоменклатураКласса</types>
      </type>
    </items>
    <items>
      <name>ВыгружатьВТиповыеОР</name>
      <description>Выгружать в типовые ОР</description>
      <code>00000000008</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ДоступныеВидыОпераций</name>
      <description>Доступные виды операций</description>
      <code>00000000007</code>
      <type>
        <types>CatalogRef.НоменклатураКласса</types>
      </type>
    </items>
    <items>
      <name>КодГруппы</name>
      <description>Код группы</description>
      <code>00000000009</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ОбъектОперации</name>
      <description>Объект операции</description>
      <code>00000000005</code>
      <type>
        <types>CatalogRef.НоменклатураКласса</types>
      </type>
    </items>
    <items>
      <name>Производитель</name>
      <description>Производитель</description>
      <code>00000000010</code>
      <type>
        <types>CatalogRef.ВариантыЗначенийАтрибутовКласса</types>
      </type>
    </items>
    <items>
      <name>ТехОперации</name>
      <description>Тех. операции</description>
      <code>00000000002</code>
      <type>
        <types>CatalogRef.НоменклатураКласса</types>
      </type>
    </items>
    <items>
      <name>ТехКарты</name>
      <description>Технологические карты</description>
      <code>00000000004</code>
      <type>
        <types>CatalogRef.НоменклатураКласса</types>
      </type>
    </items>
    <items>
      <name>ТипТехКарты</name>
      <description>Тип тех. карты</description>
      <code>00000000001</code>
      <type>
        <types>CatalogRef.НоменклатураКласса</types>
      </type>
    </items>
    <items>
      <name>УзловаяСтруктура</name>
      <description>Узловая структура</description>
      <code>00000000006</code>
      <type>
        <types>CatalogRef.Классы</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМножественное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МножественноеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникЗначений</name>
    <type>
      <types>CatalogRef.Классы</types>
      <types>CatalogRef.НоменклатураКласса</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

Project/Toir/src/InformationRegisters/ЗначенияАтрибутовКласса/ЗначенияАтрибутовКласса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияАтрибутовКласса</name>
  <resources>
    <name>ЗначениеАтрибутаКласса</name>
    <type>
      <types>Characteristic.АтрибутыКласса</types>
    </type>
  </resources>
  <dimensions>
    <name>Класс</name>
    <type>
      <types>CatalogRef.ОбъектыНоменклатуры</types>
      <types>CatalogRef.Классы</types>
      <types>CatalogRef.НоменклатураКласса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АтрибутКласса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/МножественныеЗначенияАтрибутов/МножественныеЗначенияАтрибутов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МножественныеЗначенияАтрибутов</name>
  <resources>
    <name>ДоступноеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуемоеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТабличныйАтрибут</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Класс</name>
    <type>
      <types>CatalogRef.ОбъектыНоменклатуры</types>
      <types>CatalogRef.Классы</types>
      <types>CatalogRef.НоменклатураКласса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АтрибутКласса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
      <types>CatalogRef.НаборыАтрибутов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗначениеАтрибутаКласса</name>
    <type>
      <types>CatalogRef.ОбъектыНоменклатуры</types>
      <types>CatalogRef.ВариантыЗначенийАтрибутовКласса</types>
      <types>CatalogRef.Классы</types>
      <types>CatalogRef.НоменклатураКласса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Catalogs/Классы/Классы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Классы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВидыТехОпераций</name>
      <description>Виды тех.операции</description>
    </items>
    <items>
      <name>ВложенныеТехКарты</name>
      <description>Вложенные тех карты</description>
    </items>
    <items>
      <name>КлассыТехКарт</name>
      <description>Классы тех. карт</description>
    </items>
    <items>
      <name>СтрокиТехОпераций</name>
      <description>Строки тех.операций</description>
    </items>
    <items>
      <name>ТехнологическиеКарты</name>
      <description>Технологические карты</description>
    </items>
    <items>
      <name>ТипыТехКарт</name>
      <description>Типы тех. карт</description>
    </items>
    <items>
      <name>Оборудование</name>
      <description>Оборудование</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьВИерархииТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАтрибута</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураКласса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассТабличнаяЧасть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаКласса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикКлассов</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикОбъектовНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШагСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрисвоенНомерПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимКонтроляДублейПоНаименованию</name>
    <type>
      <types>EnumRef.РежимыКонтроляДублей</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольДублейВПределахКласса</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/ChartsOfCharacteristicTypes/АтрибутыКласса/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьВыборИсточникаЗначений(Объект, Элементы);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И АтрибутИспользуется(Объект.Ссылка) Тогда
		Элементы.ТипЗначения.ТолькоПросмотр      = Истина;
		Элементы.ИсточникЗначений.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ФормаРедактироватьАтрибут.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) И АтрибутИспользуется(ТекущийОбъект.Ссылка) Тогда
		Элементы.ТипЗначения.ТолькоПросмотр      = Истина;
		Элементы.ИсточникЗначений.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ФормаРедактироватьАтрибут.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	НастроитьВыборИсточникаЗначений(Объект, Элементы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьАтрибут(Команда)
	
	ТекстВопроса = НСтр("ru='Внимание! При изменении типа значения атрибута, сохраненные значения атрибута будут потеряны. 
		|Редактировать атрибут?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("РедактироватьАтрибутЗавершение", ЭтаФорма), 
		ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВыборИсточникаЗначений(Объект, Элементы)
	
	ОписаниеТиповСсылка = Новый ОписаниеТипов("СправочникСсылка.Классы, СправочникСсылка.НоменклатураКласса");
	ТипОбъектНоменклатуры = Тип("СправочникСсылка.ОбъектыНоменклатуры");
	ТипКласс              = Тип("СправочникСсылка.Классы");
	
	ПустойКласс = ПредопределенноеЗначение("Справочник.Классы.ПустаяСсылка");
	
	КлассИлиНоменклатура = ОписаниеТиповСсылка.СодержитТип(Объект.ТипЗначения.Типы()[0]);
	ОбъектНоменклатуры = Объект.ТипЗначения.СодержитТип(ТипОбъектНоменклатуры);
	Элементы.ИсточникЗначений.Доступность = (КлассИлиНоменклатура ИЛИ ОбъектНоменклатуры);
	
	Элементы.ИсточникЗначений.ВыбиратьТип = ОбъектНоменклатуры;
	Если КлассИлиНоменклатура И НЕ ОбъектНоменклатуры
			И НЕ ТипЗнч(Объект.ИсточникЗначений) = ТипКласс Тогда
		Объект.ИсточникЗначений = ПустойКласс;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АтрибутИспользуется(АтрибутСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("АтрибутКласса", АтрибутСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗначенияАтрибутовКласса.АтрибутКласса
		|ИЗ
		|	РегистрСведений.ЗначенияАтрибутовКласса КАК ЗначенияАтрибутовКласса
		|ГДЕ
		|	ЗначенияАтрибутовКласса.АтрибутКласса = &АтрибутКласса
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	МножественныеЗначенияАтрибутов.АтрибутКласса
		|ИЗ
		|	РегистрСведений.МножественныеЗначенияАтрибутов КАК МножественныеЗначенияАтрибутов
		|ГДЕ
		|	МножественныеЗначенияАтрибутов.АтрибутКласса = &АтрибутКласса";
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции

&НаКлиенте
Процедура РедактироватьАтрибутЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ТипЗначения.ТолькоПросмотр      = Ложь;
	Элементы.ИсточникЗначений.ТолькоПросмотр = Ложь;
	
	Элементы.ФормаРедактироватьАтрибут.Пометка     = Истина;
	Элементы.ФормаРедактироватьАтрибут.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Объект.ИмяДляОбмена = СтрЗаменить(Объект.Наименование, " ", "");
	
КонецПроцедуры

#КонецОбласти

// Раздел «Обработчики событий формы» содержит процедуры-обработчики событий формы: ПриСозданииНаСервере, ПриОткрытии и т.п.
// Раздел «Обработчики событий элементов шапки формы» содержит процедуры-обработчики элементов, расположенных в основной части формы (все, что не связано с таблицами на форме).
// В разделах «Обработчики событий элементов таблицы формы <имя таблицы формы>» размещаются процедуры-обработчики таблиц формы и элементов таблиц. 
// Для процедур-обработчиков каждой таблицы должен быть создан свой раздел.
// Раздел «Обработчики команд формы» содержит процедуры-обработчики команд формы (имена которых задаются в свойстве Действие команд формы).
// Раздел «Служебные процедуры и функции» имеет такое же предназначение, что и в общих модулях.
